local navigation
[[./notes.org]]
[[./organizer.org]]
[[./lakota.org]]

**** Fun with Org Tables and Source Blocks

I believe if you execute code that returns a list in an org buffer
it will produce a table row.  Let's see (press C-c C-c with the
cursor in the source block to execute):

#+BEGIN_SRC emacs-lisp :results value
'(Name Age Profession)
#+END_SRC

#+RESULTS:
| Name | Age | Profession |

By the way, when we evaluate that Lisp code, we read the quote
and say "the following is a chunk of data".  so we dont evaluate
the following code, but the quote is removed and we return the
expression (which is everything in between the parens).  The final
part of REP Loop is Print, so that value is printed.  In this case
we're actually doing a shorthand for =(list 'Name 'Age 'Profession)=,
a list of symbols which is another use of the quote syntax.
You could also do =(quote (Name Age Profession))=

**** You Can Also Pass a Table as an Argument to a Source Block

Add your name to the table.  Position the cursor in the final row's
"Profession" column, and hit TAB.  Enter strings for the Ruby block
following.  TAB goes to the next column, SHIFT-TAB goes back.

#+name: people
| "Name"    | "Age" | "Profession"     |
| "Grant"   | "34"  | "code adept"     |
| "Frances" | "1/2" | "world absorber" |

Now, position the cursor in the following block and press C-c C-c
It will pass the table named =people= as an argument to the ruby
source block named =reverser= which is designed to return a list
of lists, i.e 2d matrix, or... an org table.

#+name: reverser
#+BEGIN_SRC ruby :var people=people
  table = []

  people.each do |person|
    row = []

    if person == people.first
      row = person
    else
      row = person.map { |str| str.reverse }
    end

    table << row
  end

  return table
#+END_SRC

#+RESULTS: reverser
| Name    | Age | Profession     |
| tnarG   | 43  | tpeda edoc     |
| secnarF | 2/1 | rebrosba dlrow |

If you position the cursor in that table and do M-x org-table-export
you can export it to a CSV file.

#+BEGIN_SRC ruby :results value
  require 'csv'

  CSV.read("path/to/file.csv")
#+END_SRC

#+RESULTS:
| Name    | Age | Profession     |
| tnarG   | 43  | tpeda edoc     |
| secnarF | 2/1 | rebrosba dlrow |
